[
  {
    "title" : "Machine Learning",
    "text" : "Machine learning (ML) is the scientific study of algorithms and statistical models that computer systems use to perform a specific task without using explicit instructions, relying on patterns and inference instead. It is seen as a subset of artificial intelligence. Machine learning algorithms build a mathematical model based on sample data, known as 'training data', in order to make predictions or decisions without being explicitly programmed to perform the task. Machine learning algorithms are used in a wide variety of applications, such as email filtering and computer vision, where it is difficult or infeasible to develop a conventional algorithm for effectively performing the task.",
    "thumbnail" : ["./images/neural.png", 200, 200],
    "active" : true,
    "left" : true
  },
  {
    "title" : "The parton content of the proton",
    "text" : "One very important ingredient for the high energy physics program of the Large Hadron Collider (<a href='https://home.cern/science/accelerators/large-hadron-collider'>LHC</a> at CERN is the determination of the parton content of the proton. The structure of the proton in terms of quarks and gluons is given by the Parton Distribution Functions.<p>In the <a href='http://nnpdf.mi.infn.it/'>NNPDF</a> we use Machine Learning techniques in order to determinate the aforementioned PDFs.<p>Some of our work has been feature in the cover of the <a href='https://link.springer.com/journal/10052/79/8'>European Physical Journal C</a>.",
    "thumbnail": ["./images/n3fit.png", 300, 300],
    "left" : false,
    "active" : true
  },
  {
    "title" : "QCD corrections to Higgs physics",
    "text" : "The Higgs boson is at the center of the physics program of the LHC at Cern. After its discovery in 2012, the effort of the phenomenological community (hep-ph) has been focused on the more precise determination of its properties.<p>I have worked on some of the most precise calculations for the determination of the corrections due to Quantum Chromodynamics (QCD) effects to Higgs boson production on the gluon fusion and Vector Boson Fusion (VBF) production channels.",
    "thumbnail": ["./images/cms-event.jpg", 300, 200],
    "left" : true,
    "active" : true
  },
  {
    "title" : "Numerical Calculations, Monte Carlo methods",
    "text" : "State-of-the-art computations in High Energy Physics (HEP) require computing very complex multi-dimensional integrals numerically, as the analytical result is often not known. Monte Carlo algoriths are generally the option of choice be it in HEP applications or elsewhere, as the error of such algorithms does not grow with the number of dimensions.<p>Our aim is to improve the efficiency of widely used methods in order to enable more physics in less time.",
    "thumbnail": ["./images/vegasflow.png", 300, 200],
    "left" : false,
    "active" : true
  }
]
